# FailedToChangeGroupLevelRef Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..GroupFailures..::..FailedToChangeGroupLevelRef Property
BuiltInFailures..::..GroupFailures Class See Also
---
Unable to change group level ref.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId FailedToChangeGroupLevelRef { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property FailedToChangeGroupLevelRef As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ FailedToChangeGroupLevelRef {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..GroupFailures Class
Autodesk.Revit.DB Namespace